In [2]:
import pandas as pd
import numpy as np
technologies= {
    'Courses':["Spark","PySpark","Spark","Python","PySpark"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Duration':['30days','50days','30days', None,np.nan]
          }
df = pd.DataFrame(technologies)
print(df)

   Courses    Fee Duration
0    Spark  22000   30days
1  PySpark  25000   50days
2    Spark  23000   30days
3   Python  24000     None
4  PySpark  26000      NaN

In [6]:
df2 = df.groupby(["Courses", "Fee"]).agg({"Fee" : 'sum'})

In [7]:
df2

                 Fee
Courses Fee
PySpark 25000  25000
        26000  26000
Python  24000  24000
Spark   22000  22000
        23000  23000

In [14]:
df3 = df2.groupby(level=0).apply( lambda x : 100 * x / float(x.sum()))

/tmp/ipykernel_22307/2088167472.py:1: FutureWarning: Not prepending group keys to the result index of transform-like apply. In the future, the group keys will be included in the index, regardless of whether the applied function returns a like-indexed object.
To preserve the previous behavior, use

	>>> .groupby(..., group_keys=False)

To adopt the future behavior and silence this warning, use

	>>> .groupby(..., group_keys=True)
  df3 = df2.groupby(level=0).apply( lambda x : 100 * x / float(x.sum()))

In [18]:
df3

                      Fee
Courses Fee
PySpark 25000   49.019608
        26000   50.980392
Python  24000  100.000000
Spark   22000   48.888889
        23000   51.111111

In [21]:
df['perc'] = 100 * df['Fee'] / df.groupby("Courses")['Fee'].transform("sum")

In [22]:
df

   Courses    Fee Duration        perc
0    Spark  22000   30days   48.888889
1  PySpark  25000   50days   49.019608
2    Spark  23000   30days   51.111111
3   Python  24000     None  100.000000
4  PySpark  26000      NaN   50.980392